{"modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_15/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_14/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_12/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_11/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_9/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_8/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_7/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_5/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "images", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "module_apply_default/hub_input/Mul/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "module_apply_default/hub_input/Sub/y", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/Conv/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_6/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_10/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_13/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_13/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "name": "module/MobilenetV2/expanded_conv_16/depthwise/depthwise_weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/BatchNorm/FusedBatchNorm/Scaled", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "320"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/project/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_16/project/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "1280"}]}}}}, "name": "module_apply_default/MobilenetV2/Conv_1/Conv2D/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "name": "module_apply_default/MobilenetV2/Conv_1/BatchNorm/FusedBatchNorm/Offset", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "1001"}]}}}}, "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1001"}]}}}}, "name": "module/MobilenetV2/Logits/Conv2d_1c_1x1/biases", "op": "Const"}, {"input": ["images", "module_apply_default/hub_input/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/hub_input/Mul", "op": "Mul"}, {"input": ["module_apply_default/hub_input/Mul", "module_apply_default/hub_input/Sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/hub_input/Sub", "op": "Sub"}, {"input": ["module_apply_default/hub_input/Sub", "module_apply_default/MobilenetV2/Conv/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/Conv/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/Conv/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/Conv/Relu6", "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise", "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Mul", "op": "Mul"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNorm", "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/Relu6", "module/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise", "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Mul", "op": "Mul"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm", "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/expand/Relu6", "module/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/depthwise/depthwise", "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Mul", "op": "Mul"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_2/project/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm"], "attr": {"_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm/Offset", "module_apply_default/MobilenetV2/expanded_conv_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_2/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_2/ArithmeticOptimizer/AddOpsRewrite_add", "module_apply_default/MobilenetV2/expanded_conv_3/expand/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/expand/Relu6", "module/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/depthwise/depthwise", "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Mul", "op": "Mul"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_3/project/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm", "module_apply_default/MobilenetV2/expanded_conv_4/expand/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/expand/Relu6", "module/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/depthwise", "op": "DepthwiseConv2dNative"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/depthwise/depthwise", "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Mul", "op": "Mul"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/Relu6", "op": "Relu6"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_4/project/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm/Mul", "op": "Conv2D"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm/Mul", "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNorm"], "attr": {"_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/project/BatchNorm/FusedBatchNorm/Offset", "module_apply_default/MobilenetV2/expanded_conv_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler:ArithmeticOptimizer:AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "module_apply_default/MobilenetV2/expanded_conv_4/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add"}, {"input": ["module_apply_default/MobilenetV2/expanded_conv_4/ArithmeticOptimizer/AddOpsRewrite_add", "module_apply_default/MobilenetV2/expanded_conv_5/expand/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, 